'''
Напишите программу для проверки истинности утверждения
¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
'''
x = bool(input('Введите значение x, любой непустой ввод будет - True или пустой ввод будет - False: '))
y = bool(input('Введите значение y, любой непустой ввод будет - True или пустой ввод будет - False: '))
z = bool(input('Введите значение z, любой непустой ввод будет - True или пустой ввод будет - False: '))


print(not (x or y or z) == (not x and not y and not z))
print(x, y, z)